import React, { useEffect, useState } from 'react'
import sajek from '../../images/Blog/sajek.jpg'
import profile from '../../assets/profile.jpg'
import { Link, useParams } from 'react-router-dom'

const SBLog = () => {
  const {id} = useParams();
  const URL = import.meta.env.VITE_API_DEMO_URL;
  // const [data, setData] = useState([]);
  const [loading, setLoading] = useState(true);
  const [error, setError] = useState(null);


  const data = [
        {
            "id": 1,
            "title": "কক্সবাজার জেলার দর্শনীয় স্থান",
            "image": "../images/Blog/sajek.jpg",
            "content": "রামু বৌদ্ধ মন্দির: ইতিহাস, সংস্কৃতি ও আধ্যাত্মিকতার মিলনস্থল কক্সবাজারের রামু উপজেলায় অবস্থিত রামু বৌদ্ধ মন্দির বাংলাদেশে বৌদ্ধ সংস্কৃতির এক অমূল্য নিদর্শন। এটি শুধু একটি ধর্মীয় স্থাপনা নয়, বরং ইতিহাস, শিল্পকলা এবং শান্তির এক অসাধারণ প্রতীক। সবুজ পাহাড়ের মাঝে এই মন্দির যেন প্রকৃতির গায়ে আঁকা এক মনোমুগ্ধকর চিত্রকর্ম। এখানে এসে আপনি যেমন ধর্মীয় আচার-অনুষ্ঠানের সান্নিধ্য পাবেন, তেমনই পাবেন প্রকৃতির বিশুদ্ধতার ছোঁয়া। মন্দিরের আকর্ষণ ১. বিশালাকার বুদ্ধ মূর্তি রামুর প্রধান আকর্ষণ হলো এখানকার বিশালাকার শায়িত বুদ্ধ মূর্তি। ১০০ ফুট লম্বা এই মূর্তি দেখে আপনার মনে হবে, বুদ্ধ নিজেই যেন এখানে বিশ্রাম নিচ্ছেন। এটি বাংলাদেশের সবচেয়ে বড় বুদ্ধ মূর্তিগুলোর একটি এবং এটি দেখতে হাজার হাজার পর্যটক এখানে আসেন। বুদ্ধের মূর্তির সামনাসামনি দাঁড়িয়ে এক ধরনের আধ্যাত্মিক প্রশান্তি অনুভব করবেন। ২. প্রাচীন বৌদ্ধ স্থাপত্য ও চিত্রকর্ম রামুর বৌদ্ধ মন্দিরের ভেতরে ও বাইরে প্রাচীন বৌদ্ধ স্থাপত্য এবং চিত্রকর্ম দেখতে পারবেন। মন্দিরের দেয়ালে খোদাই করা বিভিন্ন চিত্রকর্ম বুদ্ধের জীবন ও শিক্ষার উপর ভিত্তি করে তৈরি। এখানকার কারুকার্য আপনাকে মুগ্ধ করবে এবং প্রতিটি কোণেই আপনি খুঁজে পাবেন শিল্প ও আধ্যাত্মিকতার মিলন। ৩. বুদ্ধপূর্নিমা ও ধর্মীয় অনুষ্ঠান বছরের বিভিন্ন সময়ে এখানে ধর্মীয় উৎসব পালন করা হয়, বিশেষ করে বুদ্ধপূর্নিমা এখানে অত্যন্ত উৎসাহের সাথে উদযাপিত হয়। এই সময় মন্দির প্রাঙ্গণ সজ্জিত হয় বর্ণিল আলোকসজ্জায়, এবং স্থানীয়রা ধর্মীয় আচার-অনুষ্ঠানে অংশগ্রহণ করে। এতে অংশ নিয়ে আপনি বৌদ্ধ ধর্মের সংস্কৃতি ও আচার সম্পর্কে জানতে পারবেন। কেন রামু বৌদ্ধ মন্দিরে যাবেন? যদি আপনি ধর্ম, সংস্কৃতি এবং ইতিহাসের এক অনন্য মেলবন্ধন দেখতে চান, তাহলে রামু বৌদ্ধ মন্দির আপনার জন্য উপযুক্ত গন্তব্য। এখানে এসে আপনি শুধু ইতিহাসের অংশ হবেন না, বরং আধ্যাত্মিক প্রশান্তিরও অভিজ্ঞতা পাবেন। সবুজ পাহাড়ের মাঝে এই শান্তির স্থানে এসে মনে হবে, “এখানে এলে মনটা কতটা হালকা হয়ে যায়!” রামু বৌদ্ধ মন্দির, কক্সবাজার যাওয়ার উপায় রামু বৌদ্ধ মন্দির কক্সবাজার জেলার রামু উপজেলায় অবস্থিত, যা বাংলাদেশের অন্যতম গুরুত্বপূর্ণ বৌদ্ধ ধর্মীয় স্থান। এখানে বিশাল বুদ্ধের মূর্তি এবং দৃষ্টিনন্দন বৌদ্ধ স্থাপত্য রয়েছে। রামুতে এসে বৌদ্ধ সংস্কৃতির নানা নিদর্শন",
            "user": {
                "id": 0,
                "name": "Test Name",
                "email": "test@gmail.com",
                "username": "test_123",
                "phone": "+88012344545",
                "email_verified_at": "2019-08-24T14:15:22Z",
                "created_at": "2019-08-24T14:15:22Z",
                "updated_at": "2019-08-24T14:15:22Z"
            },
            "is_published": 0,
            "is_featured": 0
        },
        {
          "id": 2,
          "title": "কক্সবাজার জেলার দর্শনীয় স্থান",
          "image": "../images/Blog/sajek.jpg",
          "content": "রামু বৌদ্ধ মন্দির: ইতিহাস, সংস্কৃতি ও আধ্যাত্মিকতার মিলনস্থল কক্সবাজারের রামু উপজেলায় অবস্থিত রামু বৌদ্ধ মন্দির বাংলাদেশে বৌদ্ধ সংস্কৃতির এক অমূল্য নিদর্শন। এটি শুধু একটি ধর্মীয় স্থাপনা নয়, বরং ইতিহাস, শিল্পকলা এবং শান্তির এক অসাধারণ প্রতীক। সবুজ পাহাড়ের মাঝে এই মন্দির যেন প্রকৃতির গায়ে আঁকা এক মনোমুগ্ধকর চিত্রকর্ম। এখানে এসে আপনি যেমন ধর্মীয় আচার-অনুষ্ঠানের সান্নিধ্য পাবেন, তেমনই পাবেন প্রকৃতির বিশুদ্ধতার ছোঁয়া। মন্দিরের আকর্ষণ ১. বিশালাকার বুদ্ধ মূর্তি রামুর প্রধান আকর্ষণ হলো এখানকার বিশালাকার শায়িত বুদ্ধ মূর্তি। ১০০ ফুট লম্বা এই মূর্তি দেখে আপনার মনে হবে, বুদ্ধ নিজেই যেন এখানে বিশ্রাম নিচ্ছেন। এটি বাংলাদেশের সবচেয়ে বড় বুদ্ধ মূর্তিগুলোর একটি এবং এটি দেখতে হাজার হাজার পর্যটক এখানে আসেন। বুদ্ধের মূর্তির সামনাসামনি দাঁড়িয়ে এক ধরনের আধ্যাত্মিক প্রশান্তি অনুভব করবেন। ২. প্রাচীন বৌদ্ধ স্থাপত্য ও চিত্রকর্ম রামুর বৌদ্ধ মন্দিরের ভেতরে ও বাইরে প্রাচীন বৌদ্ধ স্থাপত্য এবং চিত্রকর্ম দেখতে পারবেন। মন্দিরের দেয়ালে খোদাই করা বিভিন্ন চিত্রকর্ম বুদ্ধের জীবন ও শিক্ষার উপর ভিত্তি করে তৈরি। এখানকার কারুকার্য আপনাকে মুগ্ধ করবে এবং প্রতিটি কোণেই আপনি খুঁজে পাবেন শিল্প ও আধ্যাত্মিকতার মিলন। ৩. বুদ্ধপূর্নিমা ও ধর্মীয় অনুষ্ঠান বছরের বিভিন্ন সময়ে এখানে ধর্মীয় উৎসব পালন করা হয়, বিশেষ করে বুদ্ধপূর্নিমা এখানে অত্যন্ত উৎসাহের সাথে উদযাপিত হয়। এই সময় মন্দির প্রাঙ্গণ সজ্জিত হয় বর্ণিল আলোকসজ্জায়, এবং স্থানীয়রা ধর্মীয় আচার-অনুষ্ঠানে অংশগ্রহণ করে। এতে অংশ নিয়ে আপনি বৌদ্ধ ধর্মের সংস্কৃতি ও আচার সম্পর্কে জানতে পারবেন। কেন রামু বৌদ্ধ মন্দিরে যাবেন? যদি আপনি ধর্ম, সংস্কৃতি এবং ইতিহাসের এক অনন্য মেলবন্ধন দেখতে চান, তাহলে রামু বৌদ্ধ মন্দির আপনার জন্য উপযুক্ত গন্তব্য। এখানে এসে আপনি শুধু ইতিহাসের অংশ হবেন না, বরং আধ্যাত্মিক প্রশান্তিরও অভিজ্ঞতা পাবেন। সবুজ পাহাড়ের মাঝে এই শান্তির স্থানে এসে মনে হবে, “এখানে এলে মনটা কতটা হালকা হয়ে যায়!” রামু বৌদ্ধ মন্দির, কক্সবাজার যাওয়ার উপায় রামু বৌদ্ধ মন্দির কক্সবাজার জেলার রামু উপজেলায় অবস্থিত, যা বাংলাদেশের অন্যতম গুরুত্বপূর্ণ বৌদ্ধ ধর্মীয় স্থান। এখানে বিশাল বুদ্ধের মূর্তি এবং দৃষ্টিনন্দন বৌদ্ধ স্থাপত্য রয়েছে। রামুতে এসে বৌদ্ধ সংস্কৃতির নানা নিদর্শন",
          "user": {
              "id": 0,
              "name": "Test Name",
              "email": "test@gmail.com",
              "username": "test_123",
              "phone": "+88012344545",
              "email_verified_at": "2019-08-24T14:15:22Z",
              "created_at": "2019-08-24T14:15:22Z",
              "updated_at": "2019-08-24T14:15:22Z"
          },
          "is_published": 0,
          "is_featured": 0
        },
        {
          "id": 3,
          "title": "কক্সবাজার জেলার দর্শনীয় স্থান",
          "image": "../images/Blog/sajek.jpg",
          "content": "রামু বৌদ্ধ মন্দির: ইতিহাস, সংস্কৃতি ও আধ্যাত্মিকতার মিলনস্থল কক্সবাজারের রামু উপজেলায় অবস্থিত রামু বৌদ্ধ মন্দির বাংলাদেশে বৌদ্ধ সংস্কৃতির এক অমূল্য নিদর্শন। এটি শুধু একটি ধর্মীয় স্থাপনা নয়, বরং ইতিহাস, শিল্পকলা এবং শান্তির এক অসাধারণ প্রতীক। সবুজ পাহাড়ের মাঝে এই মন্দির যেন প্রকৃতির গায়ে আঁকা এক মনোমুগ্ধকর চিত্রকর্ম। এখানে এসে আপনি যেমন ধর্মীয় আচার-অনুষ্ঠানের সান্নিধ্য পাবেন, তেমনই পাবেন প্রকৃতির বিশুদ্ধতার ছোঁয়া। মন্দিরের আকর্ষণ ১. বিশালাকার বুদ্ধ মূর্তি রামুর প্রধান আকর্ষণ হলো এখানকার বিশালাকার শায়িত বুদ্ধ মূর্তি। ১০০ ফুট লম্বা এই মূর্তি দেখে আপনার মনে হবে, বুদ্ধ নিজেই যেন এখানে বিশ্রাম নিচ্ছেন। এটি বাংলাদেশের সবচেয়ে বড় বুদ্ধ মূর্তিগুলোর একটি এবং এটি দেখতে হাজার হাজার পর্যটক এখানে আসেন। বুদ্ধের মূর্তির সামনাসামনি দাঁড়িয়ে এক ধরনের আধ্যাত্মিক প্রশান্তি অনুভব করবেন। ২. প্রাচীন বৌদ্ধ স্থাপত্য ও চিত্রকর্ম রামুর বৌদ্ধ মন্দিরের ভেতরে ও বাইরে প্রাচীন বৌদ্ধ স্থাপত্য এবং চিত্রকর্ম দেখতে পারবেন। মন্দিরের দেয়ালে খোদাই করা বিভিন্ন চিত্রকর্ম বুদ্ধের জীবন ও শিক্ষার উপর ভিত্তি করে তৈরি। এখানকার কারুকার্য আপনাকে মুগ্ধ করবে এবং প্রতিটি কোণেই আপনি খুঁজে পাবেন শিল্প ও আধ্যাত্মিকতার মিলন। ৩. বুদ্ধপূর্নিমা ও ধর্মীয় অনুষ্ঠান বছরের বিভিন্ন সময়ে এখানে ধর্মীয় উৎসব পালন করা হয়, বিশেষ করে বুদ্ধপূর্নিমা এখানে অত্যন্ত উৎসাহের সাথে উদযাপিত হয়। এই সময় মন্দির প্রাঙ্গণ সজ্জিত হয় বর্ণিল আলোকসজ্জায়, এবং স্থানীয়রা ধর্মীয় আচার-অনুষ্ঠানে অংশগ্রহণ করে। এতে অংশ নিয়ে আপনি বৌদ্ধ ধর্মের সংস্কৃতি ও আচার সম্পর্কে জানতে পারবেন। কেন রামু বৌদ্ধ মন্দিরে যাবেন? যদি আপনি ধর্ম, সংস্কৃতি এবং ইতিহাসের এক অনন্য মেলবন্ধন দেখতে চান, তাহলে রামু বৌদ্ধ মন্দির আপনার জন্য উপযুক্ত গন্তব্য। এখানে এসে আপনি শুধু ইতিহাসের অংশ হবেন না, বরং আধ্যাত্মিক প্রশান্তিরও অভিজ্ঞতা পাবেন। সবুজ পাহাড়ের মাঝে এই শান্তির স্থানে এসে মনে হবে, “এখানে এলে মনটা কতটা হালকা হয়ে যায়!” রামু বৌদ্ধ মন্দির, কক্সবাজার যাওয়ার উপায় রামু বৌদ্ধ মন্দির কক্সবাজার জেলার রামু উপজেলায় অবস্থিত, যা বাংলাদেশের অন্যতম গুরুত্বপূর্ণ বৌদ্ধ ধর্মীয় স্থান। এখানে বিশাল বুদ্ধের মূর্তি এবং দৃষ্টিনন্দন বৌদ্ধ স্থাপত্য রয়েছে। রামুতে এসে বৌদ্ধ সংস্কৃতির নানা নিদর্শন",
          "user": {
              "id": 0,
              "name": "Test Name",
              "email": "test@gmail.com",
              "username": "test_123",
              "phone": "+88012344545",
              "email_verified_at": "2019-08-24T14:15:22Z",
              "created_at": "2019-08-24T14:15:22Z",
              "updated_at": "2019-08-24T14:15:22Z"
          },
          "is_published": 0,
          "is_featured": 0
        },
        {
          "id": 4,
          "title": "কক্সবাজার জেলার দর্শনীয় স্থান",
          "image": "../images/Blog/sajek.jpg",
          "content": "রামু বৌদ্ধ মন্দির: ইতিহাস, সংস্কৃতি ও আধ্যাত্মিকতার মিলনস্থল কক্সবাজারের রামু উপজেলায় অবস্থিত রামু বৌদ্ধ মন্দির বাংলাদেশে বৌদ্ধ সংস্কৃতির এক অমূল্য নিদর্শন। এটি শুধু একটি ধর্মীয় স্থাপনা নয়, বরং ইতিহাস, শিল্পকলা এবং শান্তির এক অসাধারণ প্রতীক। সবুজ পাহাড়ের মাঝে এই মন্দির যেন প্রকৃতির গায়ে আঁকা এক মনোমুগ্ধকর চিত্রকর্ম। এখানে এসে আপনি যেমন ধর্মীয় আচার-অনুষ্ঠানের সান্নিধ্য পাবেন, তেমনই পাবেন প্রকৃতির বিশুদ্ধতার ছোঁয়া। মন্দিরের আকর্ষণ ১. বিশালাকার বুদ্ধ মূর্তি রামুর প্রধান আকর্ষণ হলো এখানকার বিশালাকার শায়িত বুদ্ধ মূর্তি। ১০০ ফুট লম্বা এই মূর্তি দেখে আপনার মনে হবে, বুদ্ধ নিজেই যেন এখানে বিশ্রাম নিচ্ছেন। এটি বাংলাদেশের সবচেয়ে বড় বুদ্ধ মূর্তিগুলোর একটি এবং এটি দেখতে হাজার হাজার পর্যটক এখানে আসেন। বুদ্ধের মূর্তির সামনাসামনি দাঁড়িয়ে এক ধরনের আধ্যাত্মিক প্রশান্তি অনুভব করবেন। ২. প্রাচীন বৌদ্ধ স্থাপত্য ও চিত্রকর্ম রামুর বৌদ্ধ মন্দিরের ভেতরে ও বাইরে প্রাচীন বৌদ্ধ স্থাপত্য এবং চিত্রকর্ম দেখতে পারবেন। মন্দিরের দেয়ালে খোদাই করা বিভিন্ন চিত্রকর্ম বুদ্ধের জীবন ও শিক্ষার উপর ভিত্তি করে তৈরি। এখানকার কারুকার্য আপনাকে মুগ্ধ করবে এবং প্রতিটি কোণেই আপনি খুঁজে পাবেন শিল্প ও আধ্যাত্মিকতার মিলন। ৩. বুদ্ধপূর্নিমা ও ধর্মীয় অনুষ্ঠান বছরের বিভিন্ন সময়ে এখানে ধর্মীয় উৎসব পালন করা হয়, বিশেষ করে বুদ্ধপূর্নিমা এখানে অত্যন্ত উৎসাহের সাথে উদযাপিত হয়। এই সময় মন্দির প্রাঙ্গণ সজ্জিত হয় বর্ণিল আলোকসজ্জায়, এবং স্থানীয়রা ধর্মীয় আচার-অনুষ্ঠানে অংশগ্রহণ করে। এতে অংশ নিয়ে আপনি বৌদ্ধ ধর্মের সংস্কৃতি ও আচার সম্পর্কে জানতে পারবেন। কেন রামু বৌদ্ধ মন্দিরে যাবেন? যদি আপনি ধর্ম, সংস্কৃতি এবং ইতিহাসের এক অনন্য মেলবন্ধন দেখতে চান, তাহলে রামু বৌদ্ধ মন্দির আপনার জন্য উপযুক্ত গন্তব্য। এখানে এসে আপনি শুধু ইতিহাসের অংশ হবেন না, বরং আধ্যাত্মিক প্রশান্তিরও অভিজ্ঞতা পাবেন। সবুজ পাহাড়ের মাঝে এই শান্তির স্থানে এসে মনে হবে, “এখানে এলে মনটা কতটা হালকা হয়ে যায়!” রামু বৌদ্ধ মন্দির, কক্সবাজার যাওয়ার উপায় রামু বৌদ্ধ মন্দির কক্সবাজার জেলার রামু উপজেলায় অবস্থিত, যা বাংলাদেশের অন্যতম গুরুত্বপূর্ণ বৌদ্ধ ধর্মীয় স্থান। এখানে বিশাল বুদ্ধের মূর্তি এবং দৃষ্টিনন্দন বৌদ্ধ স্থাপত্য রয়েছে। রামুতে এসে বৌদ্ধ সংস্কৃতির নানা নিদর্শন",
          "user": {
              "id": 0,
              "name": "Test Name",
              "email": "test@gmail.com",
              "username": "test_123",
              "phone": "+88012344545",
              "email_verified_at": "2019-08-24T14:15:22Z",
              "created_at": "2019-08-24T14:15:22Z",
              "updated_at": "2019-08-24T14:15:22Z"
          },
          "is_published": 0,
          "is_featured": 0
        },
        {
          "id": 5,
          "title": "কক্সবাজার জেলার দর্শনীয় স্থান",
          "image": "../images/Blog/sajek.jpg",
          "content": "রামু বৌদ্ধ মন্দির: ইতিহাস, সংস্কৃতি ও আধ্যাত্মিকতার মিলনস্থল কক্সবাজারের রামু উপজেলায় অবস্থিত রামু বৌদ্ধ মন্দির বাংলাদেশে বৌদ্ধ সংস্কৃতির এক অমূল্য নিদর্শন। এটি শুধু একটি ধর্মীয় স্থাপনা নয়, বরং ইতিহাস, শিল্পকলা এবং শান্তির এক অসাধারণ প্রতীক। সবুজ পাহাড়ের মাঝে এই মন্দির যেন প্রকৃতির গায়ে আঁকা এক মনোমুগ্ধকর চিত্রকর্ম। এখানে এসে আপনি যেমন ধর্মীয় আচার-অনুষ্ঠানের সান্নিধ্য পাবেন, তেমনই পাবেন প্রকৃতির বিশুদ্ধতার ছোঁয়া। মন্দিরের আকর্ষণ ১. বিশালাকার বুদ্ধ মূর্তি রামুর প্রধান আকর্ষণ হলো এখানকার বিশালাকার শায়িত বুদ্ধ মূর্তি। ১০০ ফুট লম্বা এই মূর্তি দেখে আপনার মনে হবে, বুদ্ধ নিজেই যেন এখানে বিশ্রাম নিচ্ছেন। এটি বাংলাদেশের সবচেয়ে বড় বুদ্ধ মূর্তিগুলোর একটি এবং এটি দেখতে হাজার হাজার পর্যটক এখানে আসেন। বুদ্ধের মূর্তির সামনাসামনি দাঁড়িয়ে এক ধরনের আধ্যাত্মিক প্রশান্তি অনুভব করবেন। ২. প্রাচীন বৌদ্ধ স্থাপত্য ও চিত্রকর্ম রামুর বৌদ্ধ মন্দিরের ভেতরে ও বাইরে প্রাচীন বৌদ্ধ স্থাপত্য এবং চিত্রকর্ম দেখতে পারবেন। মন্দিরের দেয়ালে খোদাই করা বিভিন্ন চিত্রকর্ম বুদ্ধের জীবন ও শিক্ষার উপর ভিত্তি করে তৈরি। এখানকার কারুকার্য আপনাকে মুগ্ধ করবে এবং প্রতিটি কোণেই আপনি খুঁজে পাবেন শিল্প ও আধ্যাত্মিকতার মিলন। ৩. বুদ্ধপূর্নিমা ও ধর্মীয় অনুষ্ঠান বছরের বিভিন্ন সময়ে এখানে ধর্মীয় উৎসব পালন করা হয়, বিশেষ করে বুদ্ধপূর্নিমা এখানে অত্যন্ত উৎসাহের সাথে উদযাপিত হয়। এই সময় মন্দির প্রাঙ্গণ সজ্জিত হয় বর্ণিল আলোকসজ্জায়, এবং স্থানীয়রা ধর্মীয় আচার-অনুষ্ঠানে অংশগ্রহণ করে। এতে অংশ নিয়ে আপনি বৌদ্ধ ধর্মের সংস্কৃতি ও আচার সম্পর্কে জানতে পারবেন। কেন রামু বৌদ্ধ মন্দিরে যাবেন? যদি আপনি ধর্ম, সংস্কৃতি এবং ইতিহাসের এক অনন্য মেলবন্ধন দেখতে চান, তাহলে রামু বৌদ্ধ মন্দির আপনার জন্য উপযুক্ত গন্তব্য। এখানে এসে আপনি শুধু ইতিহাসের অংশ হবেন না, বরং আধ্যাত্মিক প্রশান্তিরও অভিজ্ঞতা পাবেন। সবুজ পাহাড়ের মাঝে এই শান্তির স্থানে এসে মনে হবে, “এখানে এলে মনটা কতটা হালকা হয়ে যায়!” রামু বৌদ্ধ মন্দির, কক্সবাজার যাওয়ার উপায় রামু বৌদ্ধ মন্দির কক্সবাজার জেলার রামু উপজেলায় অবস্থিত, যা বাংলাদেশের অন্যতম গুরুত্বপূর্ণ বৌদ্ধ ধর্মীয় স্থান। এখানে বিশাল বুদ্ধের মূর্তি এবং দৃষ্টিনন্দন বৌদ্ধ স্থাপত্য রয়েছে। রামুতে এসে বৌদ্ধ সংস্কৃতির নানা নিদর্শন",
          "user": {
              "id": 0,
              "name": "Test Name",
              "email": "test@gmail.com",
              "username": "test_123",
              "phone": "+88012344545",
              "email_verified_at": "2019-08-24T14:15:22Z",
              "created_at": "2019-08-24T14:15:22Z",
              "updated_at": "2019-08-24T14:15:22Z"
          },
          "is_published": 0,
          "is_featured": 0
        },
        {
          "id": 6,
          "title": "কক্সবাজার জেলার দর্শনীয় স্থান",
          "image": "../images/Blog/sajek.jpg",
          "content": "রামু বৌদ্ধ মন্দির: ইতিহাস, সংস্কৃতি ও আধ্যাত্মিকতার মিলনস্থল কক্সবাজারের রামু উপজেলায় অবস্থিত রামু বৌদ্ধ মন্দির বাংলাদেশে বৌদ্ধ সংস্কৃতির এক অমূল্য নিদর্শন। এটি শুধু একটি ধর্মীয় স্থাপনা নয়, বরং ইতিহাস, শিল্পকলা এবং শান্তির এক অসাধারণ প্রতীক। সবুজ পাহাড়ের মাঝে এই মন্দির যেন প্রকৃতির গায়ে আঁকা এক মনোমুগ্ধকর চিত্রকর্ম। এখানে এসে আপনি যেমন ধর্মীয় আচার-অনুষ্ঠানের সান্নিধ্য পাবেন, তেমনই পাবেন প্রকৃতির বিশুদ্ধতার ছোঁয়া। মন্দিরের আকর্ষণ ১. বিশালাকার বুদ্ধ মূর্তি রামুর প্রধান আকর্ষণ হলো এখানকার বিশালাকার শায়িত বুদ্ধ মূর্তি। ১০০ ফুট লম্বা এই মূর্তি দেখে আপনার মনে হবে, বুদ্ধ নিজেই যেন এখানে বিশ্রাম নিচ্ছেন। এটি বাংলাদেশের সবচেয়ে বড় বুদ্ধ মূর্তিগুলোর একটি এবং এটি দেখতে হাজার হাজার পর্যটক এখানে আসেন। বুদ্ধের মূর্তির সামনাসামনি দাঁড়িয়ে এক ধরনের আধ্যাত্মিক প্রশান্তি অনুভব করবেন। ২. প্রাচীন বৌদ্ধ স্থাপত্য ও চিত্রকর্ম রামুর বৌদ্ধ মন্দিরের ভেতরে ও বাইরে প্রাচীন বৌদ্ধ স্থাপত্য এবং চিত্রকর্ম দেখতে পারবেন। মন্দিরের দেয়ালে খোদাই করা বিভিন্ন চিত্রকর্ম বুদ্ধের জীবন ও শিক্ষার উপর ভিত্তি করে তৈরি। এখানকার কারুকার্য আপনাকে মুগ্ধ করবে এবং প্রতিটি কোণেই আপনি খুঁজে পাবেন শিল্প ও আধ্যাত্মিকতার মিলন। ৩. বুদ্ধপূর্নিমা ও ধর্মীয় অনুষ্ঠান বছরের বিভিন্ন সময়ে এখানে ধর্মীয় উৎসব পালন করা হয়, বিশেষ করে বুদ্ধপূর্নিমা এখানে অত্যন্ত উৎসাহের সাথে উদযাপিত হয়। এই সময় মন্দির প্রাঙ্গণ সজ্জিত হয় বর্ণিল আলোকসজ্জায়, এবং স্থানীয়রা ধর্মীয় আচার-অনুষ্ঠানে অংশগ্রহণ করে। এতে অংশ নিয়ে আপনি বৌদ্ধ ধর্মের সংস্কৃতি ও আচার সম্পর্কে জানতে পারবেন। কেন রামু বৌদ্ধ মন্দিরে যাবেন? যদি আপনি ধর্ম, সংস্কৃতি এবং ইতিহাসের এক অনন্য মেলবন্ধন দেখতে চান, তাহলে রামু বৌদ্ধ মন্দির আপনার জন্য উপযুক্ত গন্তব্য। এখানে এসে আপনি শুধু ইতিহাসের অংশ হবেন না, বরং আধ্যাত্মিক প্রশান্তিরও অভিজ্ঞতা পাবেন। সবুজ পাহাড়ের মাঝে এই শান্তির স্থানে এসে মনে হবে, “এখানে এলে মনটা কতটা হালকা হয়ে যায়!” রামু বৌদ্ধ মন্দির, কক্সবাজার যাওয়ার উপায় রামু বৌদ্ধ মন্দির কক্সবাজার জেলার রামু উপজেলায় অবস্থিত, যা বাংলাদেশের অন্যতম গুরুত্বপূর্ণ বৌদ্ধ ধর্মীয় স্থান। এখানে বিশাল বুদ্ধের মূর্তি এবং দৃষ্টিনন্দন বৌদ্ধ স্থাপত্য রয়েছে। রামুতে এসে বৌদ্ধ সংস্কৃতির নানা নিদর্শন",
          "user": {
              "id": 0,
              "name": "Test Name",
              "email": "test@gmail.com",
              "username": "test_123",
              "phone": "+88012344545",
              "email_verified_at": "2019-08-24T14:15:22Z",
              "created_at": "2019-08-24T14:15:22Z",
              "updated_at": "2019-08-24T14:15:22Z"
          },
          "is_published": 0,
          "is_featured": 0
        }
      ];



  // useEffect(() => {
  //     const fetchDataForPosts = async () => {
  //         try {
  //             const response = await fetch(URL + '/' + id);
  //             if (!response.ok) {
  //                 throw new Error(`HTTP error: Status ${response.status}`);
  //             }
  //             const result = await response.json();
  //             setData(result);
  //         } catch (err) {
  //             setError(err.message);
  //             setData([]);
  //         } finally {
  //             setLoading(false);
  //         }
  //     };
  
  //     fetchDataForPosts();
  // }, [URL]);

  return (
    <div className='mx-auto mt-28 px-4 sm:px-[5vw] md:px-[7vw] lg:px-[9vw]'>
      {/* {loading && <p>Loading...</p>} */}
      {/* {error && <p className='text-red-500'>{error}</p>} */}
      <div className='w-full grid grid-cols-12 gap-3'>
        <div className='col-start-1 col-span-12 xl:col-span-9 p-4 rounded-lg shadow-[rgba(50,_50,_105,_0.15)_0px_2px_5px_0px,_rgba(0,_0,_0,_0.05)_0px_1px_1px_0px]'>
          <div className='w-full'>
            <div className='overflow-hidden rounded-md flex justify-center items-center'><img src={sajek} alt="Blog image" className='w-full' /></div>
            <div className='mt-2 flex items-center justify-between gap-x-4'>
              <div className='flex items-center gap-x-1'>
                <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" strokeWidth={1.5} stroke="currentColor" className="size-4 md:size-5">
                  <path strokeLinecap="round" strokeLinejoin="round" d="M15.75 6a3.75 3.75 0 1 1-7.5 0 3.75 3.75 0 0 1 7.5 0ZM4.501 20.118a7.5 7.5 0 0 1 14.998 0A17.933 17.933 0 0 1 12 21.75c-2.676 0-5.216-.584-7.499-1.632Z" />
                </svg>
                <p className='text-xs md:text-sm'>By {data[0].user.name}</p>
              </div>
              <div className='flex items-center gap-x-1'>
                <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" strokeWidth={1.5} stroke="currentColor" className="size-4 md:size-5">
                  <path strokeLinecap="round" strokeLinejoin="round" d="M6.75 3v2.25M17.25 3v2.25M3 18.75V7.5a2.25 2.25 0 0 1 2.25-2.25h13.5A2.25 2.25 0 0 1 21 7.5v11.25m-18 0A2.25 2.25 0 0 0 5.25 21h13.5A2.25 2.25 0 0 0 21 18.75m-18 0v-7.5A2.25 2.25 0 0 1 5.25 9h13.5A2.25 2.25 0 0 1 21 11.25v7.5" />
                </svg>
                <p className='text-xs md:text-sm'>{data[0].user.created_at}</p>
              </div>
            </div>
          </div>
          <div className='mt-3 sm:mt-8 w-full font-noto'>
            <h1 className='text-lg sm:text-2xl 2xl:text-3xl font-bold'>{data[0].title}</h1>
            <p className='mt-2'>{data[0].content}</p>
          </div>
        </div>
        <div className='col-start-1 xl:col-start-10 col-span-12 xl:col-span-3'>
          <div className='p-4 flex xl:flex-col items-center gap-x-4 xl:gap-x-4 rounded-lg shadow-[rgba(50,_50,_105,_0.15)_0px_2px_5px_0px,_rgba(0,_0,_0,_0.05)_0px_1px_1px_0px]'>
            <div className='w-20 h-20 overflow-hidden rounded-full'><img className='' src={profile} alt="profile" /></div>
            <div className='w-20 xl:w-full flex flex-col xl:items-center'>
              <p className='pt-2 font-semibold'>{data[0].user.name}</p>
              <p className='text-xs text-gray-600'>@{data[0].user.username}</p>
              <Link className='mt-2 py-[3px] px-5 xl:px-0 xl:w-full max-w-64 border border-slate-700 hover:bg-slate-900 text-[9px] sm:text-sm hover:text-white font-poppins duration-300 text-slate-900 font-medium rounded flex items-center justify-center'>Profile</Link>
            </div>
          </div>
          <div className='mt-3 p-4 flex flex-col items-center rounded-lg shadow-[rgba(50,_50,_105,_0.15)_0px_2px_5px_0px,_rgba(0,_0,_0,_0.05)_0px_1px_1px_0px]'>
            <div className='w-full flex items-center gap-x-5 xl:gap-x-3'>
              <div className="flex-grow h-[2px] bg-gradient-to-l from-gray-300"></div>
              <p className="text-xs text-gray-700 font-bold">More blogs from this author</p>
              <div className="flex-grow h-[2px] bg-gradient-to-r from-gray-300"></div>
            </div>
            <div className='w-full'>
                {Array.isArray(data) && data.length > 1 ? (
                  data.slice(1, 6).map((post, index)=>(
                      <Link
                        key={post.id}
                        className={`group mt-3 pb-3 flex gap-x-3 text-sm font-medium font-noto ${
                          index === data.slice(1, 6).length - 1 ? '' : 'border-b'
                        }`}
                      >
                        <img className="w-28 md:w-40 xl:w-20 rounded-[3px]" src={sajek} alt="" />
                        <div className='py-[2px]'>
                          <p className='text-lg sm:text-xl xl:text-base font-semibold group-hover:text-red-500'>{post.title}</p>
                          <p className="xl:hidden text-xs sm:text-[16px] text-gray-700 group-hover:text-red-500">{post.content.substring(0, 120) + '...'}</p>
                        </div>
                      </Link>
                    ))
                  ):(
                      !loading && <p className='text-gray-500'>No posts available</p>
                  )
                }
            </div>
          </div>
        </div>
      </div>
    </div>
  )
}

export default SBLog